In [1]:
people = {
    "Name": ["Gautam", "Kumaresan", "Devi"],
    "Age": [26, 61, 53],
    "Gender": ["Male", "Male", "Female"]
}
import pandas as pd
df = pd.DataFrame(people)
df

        Name  Age  Gender
0     Gautam   26    Male
1  Kumaresan   61    Male
2       Devi   53  Female

In [2]:
# UPDATING COLUMN NAMES
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [4]:
# UPDATING ALL COLUMN NAMES
df.columns = ['Full Name', 'Age in Number', 'Gender as String']
df

   Full Name  Age in Number Gender as String
0     Gautam             26             Male
1  Kumaresan             61             Male
2       Devi             53           Female

In [5]:
# UPDATING ALL COLUMN NAMES WITH LIST COMPREHENSION
df.columns = [x.upper() for x in df.columns]
df

   FULL NAME  AGE IN NUMBER GENDER AS STRING
0     Gautam             26             Male
1  Kumaresan             61             Male
2       Devi             53           Female

In [7]:
# UPDATING ALL COLUMN NAMES WITH STRING REPLACE
df.columns = df.columns.str.replace(' ',  '_')
df

   FULL_NAME  AGE_IN_NUMBER GENDER_AS_STRING
0     Gautam             26             Male
1  Kumaresan             61             Male
2       Devi             53           Female

In [8]:
# UPDATING SPECIFIC COLUMN NAMES
df.rename(columns={"FULL_NAME": "Name", "AGE_IN_NUMBER": "Age", "GENDER_AS_STRING": "Gender"}, inplace=True)
df

        Name  Age  Gender
0     Gautam   26    Male
1  Kumaresan   61    Male
2       Devi   53  Female

In [9]:
# UPDATING DATA IN ROWS
# COMPLETE ROW
df.loc[0] = ['Tharun', '2', 'Male']
df

        Name Age  Gender
0     Tharun   2    Male
1  Kumaresan  61    Male
2       Devi  53  Female

In [11]:
#FILTERING AND UPDATING SELCECTED COLUMNS
nameFilt = (df['Name'] == 'Tharun')
df.loc[nameFilt, ['Name', 'Age']] = ['Mallan', '2']
df

        Name Age  Gender
0     Mallan   2    Male
1  Kumaresan  61    Male
2       Devi  53  Female

In [13]:
# UPDATING SINGLE VALUE USING LOC
nameFilt = (df['Name'] == 'Mallan')
df.loc[nameFilt, 'Name'] = 'Tharun'
df

        Name Age  Gender
0     Tharun   2    Male
1  Kumaresan  61    Male
2       Devi  53  Female

In [14]:
df.at[0, 'Name'] = 'Kutti T-Rex'
df

          Name Age  Gender
0  Kutti T-Rex   2    Male
1    Kumaresan  61    Male
2         Devi  53  Female

In [16]:
# WARNING WILL SHOW IF WE DONT USE LOC, ILOC OR AT METHODS BECAUSE OTHERWISE WILL BE USING TEMPORARY MEMORY DATA
nameFilt = (df['Name'] == 'Kutti T-Rex')
df[nameFilt]['Age'] = '3'

<ipython-input-16-a985940d982b>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[nameFilt]['Age'] = '3'

In [17]:
# VALUE ALSO WONT CHANGE IF WE GET ABOVE WARNING
df

          Name Age  Gender
0  Kutti T-Rex   2    Male
1    Kumaresan  61    Male
2         Devi  53  Female

In [18]:
nameFilt = (df['Name'] == 'Kutti T-Rex')
df.loc[nameFilt, 'Age'] = '3'
df

          Name Age  Gender
0  Kutti T-Rex   3    Male
1    Kumaresan  61    Male
2         Devi  53  Female

In [21]:
# MAKE ALL ELEMNTS IN A COLUMN LOWER CASE
df['Gender'] = df['Gender'].str.lower()
df

          Name Age  Gender
0  Kutti T-Rex   3    male
1    Kumaresan  61    male
2         Devi  53  female